org/about.org
* About
  Hello, I am Mohamed Fouad a.k.a zotherstupidguy, a Software
  Philosopher living in Alexandria, Egypt; and this is my day-to-day b(log). 
  I am available for [hire [link to google docs resume]].
  This is an org-mode generated log (Org-Agenda, Org-Capture, tag-based organization) via those [[https://github.com/zotherstupidguy/dotfiles][dotfiles]] 
  and acutal [[https://github.com/zotherstupidguy/zotherstupidguy.github.io][source]] of this blog. 
  
  -----

  Why zotherstupidguy nick? it is a joke and a reminder that being smart is totally relevant to my current knowledge circles,
  and I must always seek ideas outside of my regular knowledge circles, anything that I am already familair with probably wouldn't breed me 
  an *orginal* idea, I must seek doctrine depth through skeptic breadths!

  -----
  
  *As lazy as I am*, I plan using the notes here *to cheat at phone interviews*, 
  Emacs got a nice regex search ;) IF YOU BELONG TO THE SET OF THE FEW PEOPLE 
  ON EARTH WHO READ MY BLOG *AND* ACTUALLY PLAN TO HIRE ME, 
  PLEASE LET ME KNOW IF YOU THINK I AM FUNNY.

  -----
  Once in a while, I examine how Top Universities offer their mathematics and computer science related programs. I try to find what kind of books they set as 
  textbooks, to go read them on my own, purchase them from Amazon (I only like *Hardcover* books!), or scout them in the cheap 2nd hand street book markets. 
  My act is inspired by *“You wasted $150,000 on an education you coulda got for $1.50 in late fees at the public library.” ― Matt Damon, Good Will Hunting*. 
  I worship those Professors who offer their courses online for free! If it is up to me I build them real-size human sculptures in my City. 
  *Knoweldge belong to all mankind, not to copyright owners who suffer from financial insecurities!*
  ----- 
  Public keys(if you wish to communicate with me securely)
  ----- 
  Strategy is doing the right things, tactics is doing things right! 

** Funny Thoughts

   Anicent Egyptians had n gods, as each person was ws focused into their profession that they created a god for thisf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf

   Anicent Egyptians had n gods, as each person was so focused into their profession that they created a god for this body of knowledge to worship day and night. if computer

   Anicent Egyptians had n gods, as each person was so focused into their
   profession that they created a god for this body of knowledge to
   worship day and night. If computer science folks would do the same,
   they would create Knuth God, after Donald Knuth :D    

** Companies I would like to work for
   - Thoughtbot
   - Github
   - Google
   - Amazon
   - Thoughtworks
   - Gitlab
   - Facebook
   - Twitter
   - Hackerrank
   ----- 
** Why should we hire you?
   Because AI is not that good "yet", and you and I still need other humans to survive!
** Grit :: Perseverance and Passion for Long-term Goals 
   :PROPERTIES:
   :DESCRIPTION: Must have Personal Traits via continous conditioning
   :CATEGORY: research
   :ZPT:      0
   :END:
   + Courage
     - understand that there are valuable lessons in defeat and that the vulnerability of perseverance is requisite for high achievement.  
     - 
     - 
   -----

** Studying Strategy 
   My study strategy says that each book, videocourse, etc. is in one direcotry. This is my study log, I keep all the 
   knowledge that I aquire into this file, and I organize it accordingly to smallest possible domain of knowledge such as instead of having
   a heading for Number Theory, I have multiple headings for topics such as Prime Numbers, that way when I read a book I don't read the chapters but
   I explore the glossry and find where my objective topic exists and I write it down based on:  
   - why is it worth the effort?
   - what should be persued? 
   - how it will be persued?

*** Cornell Note Taking System & Feynman Technique
    I employ the Feynman technique in the Reviewing stage of my SQ3R 

    Refs: 
    - Learn Faster with The Feynman Technique
    https://www.youtube.com/watch?v=FrNqSLPaZLc

    - How to Learn Faster with the Feynman Technique:  
    https://www.youtube.com/watch?v=_f-qkGJBPts


*** Finding Sources
    using ./link to automatically download new youtube videos and generate an RSS of it and update log.org with a TODO for watching new things.
    I can't add ZPT, can, and can't folders in the sources folders as it will make ./link difficult to know what already got downloaded.


    ----- 

** Training Strategy
   The main idea of Competitive Programming Training is to solve any given problem in under 10minutes, thus the 
   most basic studytime unit  is t = 10mins, henceforth all my study and practice activites are divided up in units of 10mins.

   I categorieze my incoming infromation into 3 categories: 
   A. Can,    12 problems, total 12t(2hrs)
   B. ZPD,    4 problems, total 12t(2hrs)
   C. Can't.  1 problem, total 12t(2hrs)

