public/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-05 Sun 19:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zotherstupidguy" />

<link href= "css/stylesheet.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="outline-container-org5ec30f0" class="outline-2">
<h2 id="org5ec30f0"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Hello, I am Mohamed Fouad a.k.a zotherstupidguy, a Software
Philosopher living in Alexandria, Egypt; and this is my day-to-day b(log). 
I am available for [hire [link to google docs resume]].
This is an org-mode generated log (Org-Agenda, Org-Capture, tag-based organization) via those <a href="https://github.com/zotherstupidguy/dotfiles">dotfiles</a> 
and acutal <a href="https://github.com/zotherstupidguy/zotherstupidguy.github.io">source</a> of this blog. 
</p>

<hr />

<p>
Why zotherstupidguy nick? it is a joke and a reminder that being smart is totally relevant to my current knowledge circles,
and I must always seek ideas outside of my regular knowledge circles, anything that I am already familair with probably wouldn't breed me 
an <b>orginal</b> idea, I must seek doctrine depth through skeptic breadths!
</p>

<hr />

<p>
<b>As lazy as I am</b>, I plan using the notes here <b>to cheat at phone interviews</b>, 
Emacs got a nice regex search ;) IF YOU BELONG TO THE SET OF THE FEW PEOPLE 
ON EARTH WHO READ MY BLOG <b>AND</b> ACTUALLY PLAN TO HIRE ME, 
PLEASE LET ME KNOW IF YOU THINK I AM FUNNY.
</p>

<hr />
<p>
Once in a while, I examine how Top Universities offer their mathematics and computer science related programs. I try to find what kind of books they set as 
textbooks, to go read them on my own, purchase them from Amazon (I only like <b>Hardcover</b> books!), or scout them in the cheap 2nd hand street book markets. 
My act is inspired by <b>“You wasted $150,000 on an education you coulda got for $1.50 in late fees at the public library.” ― Matt Damon, Good Will Hunting</b>. 
I worship those Professors who offer their courses online for free! If it is up to me I build them real-size human sculptures in my City. 
<b>Knoweldge belong to all mankind, not to copyright owners who suffer from financial insecurities!</b>
</p>
<hr />
<p>
Public keys(if you wish to communicate with me securely)
</p>
<hr />
<p>
Strategy is doing the right things, tactics is doing things right! 
</p>
</div>

<div id="outline-container-org0e0375d" class="outline-3">
<h3 id="org0e0375d"><span class="section-number-3">1.1</span> Funny Thoughts</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Anicent Egyptians had n gods, as each person was ws focused into their profession that they created a god for thisf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf sf
</p>

<p>
Anicent Egyptians had n gods, as each person was so focused into their profession that they created a god for this body of knowledge to worship day and night. if computer
</p>

<p>
Anicent Egyptians had n gods, as each person was so focused into their
profession that they created a god for this body of knowledge to
worship day and night. If computer science folks would do the same,
they would create Knuth God, after Donald Knuth :D    
</p>
</div>
</div>

<div id="outline-container-org270da9f" class="outline-3">
<h3 id="org270da9f"><span class="section-number-3">1.2</span> Companies I would like to work for</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Thoughtbot</li>
<li>Github</li>
<li>Google</li>
<li>Amazon</li>
<li>Thoughtworks</li>
<li>Gitlab</li>
<li>Facebook</li>
<li>Twitter</li>
<li>Hackerrank</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org6c2e203" class="outline-3">
<h3 id="org6c2e203"><span class="section-number-3">1.3</span> Why should we hire you?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Because AI is not that good "yet", and you and I still need other humans to survive!
</p>
</div>
</div>
<div id="outline-container-orga09e392" class="outline-3">
<h3 id="orga09e392"><span class="section-number-3">1.4</span> Grit :: Perseverance and Passion for Long-term Goals</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Courage
<ul class="org-ul">
<li>understand that there are valuable lessons in defeat and that the vulnerability of perseverance is requisite for high achievement.</li>
<li></li>

<li></li>
</ul></li>
</ul>
<hr />
</div>
</div>

<div id="outline-container-org7d8aadf" class="outline-3">
<h3 id="org7d8aadf"><span class="section-number-3">1.5</span> Studying Strategy</h3>
<div class="outline-text-3" id="text-1-5">
<p>
My study strategy says that each book, videocourse, etc. is in one direcotry. This is my study log, I keep all the 
knowledge that I aquire into this file, and I organize it accordingly to smallest possible domain of knowledge such as instead of having
a heading for Number Theory, I have multiple headings for topics such as Prime Numbers, that way when I read a book I don't read the chapters but
I explore the glossry and find where my objective topic exists and I write it down based on:  
</p>
<ul class="org-ul">
<li>why is it worth the effort?</li>
<li>what should be persued?</li>
<li>how it will be persued?</li>
</ul>
</div>

<div id="outline-container-orge79bf20" class="outline-4">
<h4 id="orge79bf20"><span class="section-number-4">1.5.1</span> Cornell Note Taking System &amp; Feynman Technique</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
I employ the Feynman technique in the Reviewing stage of my SQ3R 
</p>

<p>
Refs: 
</p>
<ul class="org-ul">
<li>Learn Faster with The Feynman Technique</li>
</ul>
<p>
<a href="https://www.youtube.com/watch?v=FrNqSLPaZLc">https://www.youtube.com/watch?v=FrNqSLPaZLc</a>
</p>

<ul class="org-ul">
<li>How to Learn Faster with the Feynman Technique:</li>
</ul>
<p>
<a href="https://www.youtube.com/watch?v=_f-qkGJBPts">https://www.youtube.com/watch?v=_f-qkGJBPts</a>
</p>
</div>
</div>


<div id="outline-container-orgd2480ac" class="outline-4">
<h4 id="orgd2480ac"><span class="section-number-4">1.5.2</span> Finding Sources</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
using ./link to automatically download new youtube videos and generate an RSS of it and update log.org with a TODO for watching new things.
I can't add ZPT, can, and can't folders in the sources folders as it will make ./link difficult to know what already got downloaded.
</p>


<hr />
</div>
</div>
</div>

<div id="outline-container-orgac9bf73" class="outline-3">
<h3 id="orgac9bf73"><span class="section-number-3">1.6</span> Training Strategy</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The main idea of Competitive Programming Training is to solve any given problem in under 10minutes, thus the 
most basic studytime unit  is t = 10mins, henceforth all my study and practice activites are divided up in units of 10mins.
</p>

<p>
I categorieze my incoming infromation into 3 categories: 
A. Can,    12 problems, total 12t(2hrs)
B. ZPD,    4 problems, total 12t(2hrs)
C. Can't.  1 problem, total 12t(2hrs)
</p>
</div>
</div>
