org/about.org
** ZotherZPD(Zone of Proximal Development) Index
   - Can't is *0  =  ZPD0, thus I name respective headings with :zpd0:
   - ZPD is *1    = ZPD1, thus I name respective headings with :zpd1;
   - Can is *2    = ZPD2, thus I name respective headings with :zpd2:
     According to this index I can *automatically* calculate (via emacs) 
   a score * 0 or * 1 or * 2 / by the number of shit I am trying to accomplish.


   I start my day trying to attack category *C. Can't* to fail and study a bit, 
   then go for the *B.ZPD* which is my zone of proximal development, 
   with some effort I can succeed in solving a problem in 30mins.
   then I end my day with the *A.can* somthing that I solved before or know I can solve. 
   Simple Objectives results in Simple Delights makes me happy at the end of the day. 

   After Studying or Practice, blog about it using the Feynman Technique,  

   All problems are solved in C with emacs templates to save time.

   In order to achieve that training is divided into 3 difficulity/time categories: ZPT0, ZPT1, ZPT2.
   - 2hrs for *one* ZPT0 problem, this is a problem that are too difficult to solve and requires significant studying  
   to be familiar with the nessesary knowledge domain(s), 
     the 2hours are dedicated for 
     - Understanding the problem
     - Identifying which knowledge domain(s) it belongs to.
     - Reading about those knowledge domain(s).
     - Attempt to provide a solution  
     - 2hrs for *up to 4* ZPT1 problems, those are problems that their solutions depends on knowledge domain(s) 
     that I am already familiar with. 
     - 2hrs for *up to 12* ZPT2 problems, those are probems that I solved in the past one time or more and 
     I need to enhance my speed in solving them.


   ----- 

** Publish it! 
   Naturally I could write a book or two from the notes I have written into this file. As a matter of fact, I belive that
   *the only way* computer scientets are capable of writing so many powerful books is due to the fact that they use
   emacs in a similar way to what I am doing here, I can collect information and tag it, search it easily and update it,
   check cross references, etc. *It feels Awesome to be that Powerful!* I think i will keep taking notes in notebooks and as a review, I 
   will transfer the notes to this org document. I expect to be able to have codeblocks, latex formulas and maybe even 
   graphs. Eventually I shall publish a series about computer science via https://leanpub.com, call it "zotherstupidguy computer science notes" 
   each volume is small 100pages book of notes and commentary. 

** Brain Waves
   Each of us can use brainwave entrainment to achieve a variety of results. 
   You may want to target a specific brainwave frequency range to help you relax,. 
   On the other hand you may want to increase you creative energy, improve your memory, 
   deepen your sleep or get better results when playing a sport.
*** Beta brainwaves
    (14 to 32 Hz alert, focused)
    Beta is the most common brain wave pattern: Beta brainwaves are produced when we are wide awake, alert, 
    active and engaged in mental activity, usually involving more the rational, reality-oriented left hemisphere of our brain. 
    When beta wave activity becomes very intense, our brain hemispheres become less synchronized. 
    Beta state is required to function properly in your everyday life.
**** Features and Benefits of a Beta State
     - This is the brainwave for the fight-flight response
     - Increased concentration and alertness
     - Improved logic, reasoning and critical thinking
     - Feelings of anxiety, stress, scatty unfocused thought
     NOTE: Excessive Beta brainwaves are also a feature of insomnia
 
*** Alpha brainwaves
    (7 to 14 Hz relaxed yet aware, meditative)
    These are lower frequency waves: The state is generated when our thoughts are really not concentrated and our minds wonder freely, 
    or we are in a relaxed state such as meditating or daydreaming. We also experience Alpha Brainwaves when we are gently busy i
    with routine tasks like pottering in the garden, taking a shower, putting on makeup, doing light housework. 
    Alpha is considered to be the bridge between the conscious mind and the subconscious mind.

**** Features and Benefits of an Alpha State
     - Our brain hemispheres become naturally synchronized, or in-phase with each other.
     - Relaxed detached (absent-minded) awareness and daydreaming mind.
     - Enables us to remember our dreams and meditative states.
     - Link between conscious and subconscious mind, gateway to meditation.
     - Receptive to casual and auto – suggestions (hypnosis state)
     - Increased vividness benefits creative visualization and triggers imagination
     - Increased  memory retention , concentration & focus for super learning
**** Health benefits include:
     - Reduced anxiety
     - Alleviates stress and depression
     - Reduces chronic pain
     - Reduction of high blood pressure
     - Increases athletic performance
     - Increased  cerebral blood flow
     - Increased motivation, energy, and happiness

*** Theta brainwaves
    (3.5 to 7 Hz deep relaxation, twilight state)
    Theta brainwave states have been used in meditation for centuries: It is common for people to feel as if they are in a trance, 
    where the mind feels as though it may have gone to sleep although it is conscious of what is happening around it. 
    Theta induces a capacity for prolonged daydreaming, where a loss of time may be experienced.
    Theta waves are also conducive to visualization and creativity and the mind in this very relaxed state is highly receptive to direct suggestion under hypnosis. As with Alpha, in Theta our brain hemispheres are synchronized and we experience whole brain functioning.

**** Features and benefits of Theta brainwaves
     - Increased sense of inner peace and emotional stability
     - Deep relaxation
     - Improved memory
     - Heightened intuition and inspiration
     - Calms the chatter of your mind
     - Increased psychic abilities and sense of spiritual connection
     - Health benefits of Theta brainwaves
     - Speed healing, improved physical healing
     - Sleep onset and better more restful sleep
     - Release beneficial hormones related to health and longevity
     - Reduce mental fatigue
     - Reduction of anxiety and stress
     NOTE: Research has proven thirty minutes a day of Theta meditation can dramatically improve a person’s overall health and well-being. Theta meditation has also been known to result in a reduced need for sleep.
 
