public/about.html

<div id="outline-container-org7e4b954" class="outline-3">
<h3 id="org7e4b954"><span class="section-number-3">1.7</span> ZotherZPD(Zone of Proximal Development) Index</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Can't is *0  =  ZPD0, thus I name respective headings with :zpd0:</li>
<li>ZPD is *1    = ZPD1, thus I name respective headings with :zpd1;</li>
<li>Can is <b>2    = ZPD2, thus I name respective headings with :zpd2:
According to this index I can *automatically</b> calculate (via emacs)</li>
</ul>
<p>
a score * 0 or * 1 or * 2 / by the number of shit I am trying to accomplish.
</p>


<p>
I start my day trying to attack category <b>C. Can't</b> to fail and study a bit, 
then go for the <b>B.ZPD</b> which is my zone of proximal development, 
with some effort I can succeed in solving a problem in 30mins.
then I end my day with the <b>A.can</b> somthing that I solved before or know I can solve. 
Simple Objectives results in Simple Delights makes me happy at the end of the day. 
</p>

<p>
After Studying or Practice, blog about it using the Feynman Technique,  
</p>

<p>
All problems are solved in C with emacs templates to save time.
</p>

<p>
In order to achieve that training is divided into 3 difficulity/time categories: ZPT0, ZPT1, ZPT2.
</p>
<ul class="org-ul">
<li>2hrs for <b>one</b> ZPT0 problem, this is a problem that are too difficult to solve and requires significant studying</li>
</ul>
<p>
to be familiar with the nessesary knowledge domain(s), 
  the 2hours are dedicated for 
</p>
<ul class="org-ul">
<li>Understanding the problem</li>
<li>Identifying which knowledge domain(s) it belongs to.</li>
<li>Reading about those knowledge domain(s).</li>
<li>Attempt to provide a solution</li>
<li>2hrs for <b>up to 4</b> ZPT1 problems, those are problems that their solutions depends on knowledge domain(s)</li>
</ul>
<p>
that I am already familiar with. 
</p>
<ul class="org-ul">
<li>2hrs for <b>up to 12</b> ZPT2 problems, those are probems that I solved in the past one time or more and</li>
</ul>
<p>
I need to enhance my speed in solving them.
</p>


<hr />
</div>
</div>

<div id="outline-container-org0553696" class="outline-3">
<h3 id="org0553696"><span class="section-number-3">1.8</span> Publish it!</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Naturally I could write a book or two from the notes I have written into this file. As a matter of fact, I belive that
<b>the only way</b> computer scientets are capable of writing so many powerful books is due to the fact that they use
emacs in a similar way to what I am doing here, I can collect information and tag it, search it easily and update it,
check cross references, etc. <b>It feels Awesome to be that Powerful!</b> I think i will keep taking notes in notebooks and as a review, I 
will transfer the notes to this org document. I expect to be able to have codeblocks, latex formulas and maybe even 
graphs. Eventually I shall publish a series about computer science via <a href="https://leanpub.com">https://leanpub.com</a>, call it "zotherstupidguy computer science notes" 
each volume is small 100pages book of notes and commentary. 
</p>
</div>
</div>

<div id="outline-container-orgd5600db" class="outline-3">
<h3 id="orgd5600db"><span class="section-number-3">1.9</span> Brain Waves</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Each of us can use brainwave entrainment to achieve a variety of results. 
You may want to target a specific brainwave frequency range to help you relax,. 
On the other hand you may want to increase you creative energy, improve your memory, 
deepen your sleep or get better results when playing a sport.
</p>
</div>
<div id="outline-container-org3d48c5a" class="outline-4">
<h4 id="org3d48c5a"><span class="section-number-4">1.9.1</span> Beta brainwaves</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
(14 to 32 Hz alert, focused)
Beta is the most common brain wave pattern: Beta brainwaves are produced when we are wide awake, alert, 
active and engaged in mental activity, usually involving more the rational, reality-oriented left hemisphere of our brain. 
When beta wave activity becomes very intense, our brain hemispheres become less synchronized. 
Beta state is required to function properly in your everyday life.
</p>
</div>
<div id="outline-container-org5b166d4" class="outline-5">
<h5 id="org5b166d4"><span class="section-number-5">1.9.1.1</span> Features and Benefits of a Beta State</h5>
<div class="outline-text-5" id="text-1-9-1-1">
<ul class="org-ul">
<li>This is the brainwave for the fight-flight response</li>
<li>Increased concentration and alertness</li>
<li>Improved logic, reasoning and critical thinking</li>
<li>Feelings of anxiety, stress, scatty unfocused thought</li>
</ul>
<p>
NOTE: Excessive Beta brainwaves are also a feature of insomnia
</p>
</div>
</div>
</div>

<div id="outline-container-org190951d" class="outline-4">
<h4 id="org190951d"><span class="section-number-4">1.9.2</span> Alpha brainwaves</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
(7 to 14 Hz relaxed yet aware, meditative)
These are lower frequency waves: The state is generated when our thoughts are really not concentrated and our minds wonder freely, 
or we are in a relaxed state such as meditating or daydreaming. We also experience Alpha Brainwaves when we are gently busy i
with routine tasks like pottering in the garden, taking a shower, putting on makeup, doing light housework. 
Alpha is considered to be the bridge between the conscious mind and the subconscious mind.
</p>
</div>

<div id="outline-container-org3592472" class="outline-5">
<h5 id="org3592472"><span class="section-number-5">1.9.2.1</span> Features and Benefits of an Alpha State</h5>
<div class="outline-text-5" id="text-1-9-2-1">
<ul class="org-ul">
<li>Our brain hemispheres become naturally synchronized, or in-phase with each other.</li>
<li>Relaxed detached (absent-minded) awareness and daydreaming mind.</li>
<li>Enables us to remember our dreams and meditative states.</li>
<li>Link between conscious and subconscious mind, gateway to meditation.</li>
<li>Receptive to casual and auto – suggestions (hypnosis state)</li>
<li>Increased vividness benefits creative visualization and triggers imagination</li>
<li>Increased  memory retention , concentration &amp; focus for super learning</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf8396d" class="outline-5">
<h5 id="orgaf8396d"><span class="section-number-5">1.9.2.2</span> Health benefits include:</h5>
<div class="outline-text-5" id="text-1-9-2-2">
<ul class="org-ul">
<li>Reduced anxiety</li>
<li>Alleviates stress and depression</li>
<li>Reduces chronic pain</li>
<li>Reduction of high blood pressure</li>
<li>Increases athletic performance</li>
<li>Increased  cerebral blood flow</li>
<li>Increased motivation, energy, and happiness</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org154123b" class="outline-4">
<h4 id="org154123b"><span class="section-number-4">1.9.3</span> Theta brainwaves</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
(3.5 to 7 Hz deep relaxation, twilight state)
Theta brainwave states have been used in meditation for centuries: It is common for people to feel as if they are in a trance, 
where the mind feels as though it may have gone to sleep although it is conscious of what is happening around it. 
Theta induces a capacity for prolonged daydreaming, where a loss of time may be experienced.
Theta waves are also conducive to visualization and creativity and the mind in this very relaxed state is highly receptive to direct suggestion under hypnosis. As with Alpha, in Theta our brain hemispheres are synchronized and we experience whole brain functioning.
</p>
</div>

<div id="outline-container-orgcdcd0b2" class="outline-5">
<h5 id="orgcdcd0b2"><span class="section-number-5">1.9.3.1</span> Features and benefits of Theta brainwaves</h5>
<div class="outline-text-5" id="text-1-9-3-1">
<ul class="org-ul">
<li>Increased sense of inner peace and emotional stability</li>
<li>Deep relaxation</li>
<li>Improved memory</li>
<li>Heightened intuition and inspiration</li>
<li>Calms the chatter of your mind</li>
<li>Increased psychic abilities and sense of spiritual connection</li>
<li>Health benefits of Theta brainwaves</li>
<li>Speed healing, improved physical healing</li>
<li>Sleep onset and better more restful sleep</li>
<li>Release beneficial hormones related to health and longevity</li>
<li>Reduce mental fatigue</li>
<li>Reduction of anxiety and stress</li>
</ul>
<p>
NOTE: Research has proven thirty minutes a day of Theta meditation can dramatically improve a person’s overall health and well-being. Theta meditation has also been known to result in a reduced need for sleep.
</p>
</div>
</div>
</div>
