org/about.org
*** Delta brainwaves
    (0.1 to 3.5 Hz deep sleep )
    This is the slowest band of waves that our brains produce and they occur when we are in deep, dreamless sleep. 
    These waves are very beneficial for the body which restores and heals itself when in this state. 
    The delta state releases anti-aging hormones, including melatonin and DHEA. 
    Human growth hormone (HGH) is another anti-aging hormone that is increased when delta brainwaves are occurring inside the brain, 
    due to the stimulation of the pituitary gland. HGH maintains the skin, bone density, cartilage, and the joints in your body as 
    well as speeds up the healing process of joint and cartilage injuries. HGH can also help heal physical pain.

    In healthy amounts, delta brainwaves can also cause a person to have an advanced state of empathy, understanding, and compassion for others.
    Delta is the place of deepest relaxation, deepest healing, deepest spiritual connection and deepest connection with the subconscious mind. 
    It is considered to be the gateway to the unconscious mind and the collective unconscious, bringing access to the universal psyche or mind.
 
*** Gamma brainwaves
    (40Hz or higher: zen mind mastery)
    Gamma brainwave states are the most rapid in frequency. 
    Gamma hase long been considered the the brainwave that is able to link and process information from all parts of the brain. 
    It is the frequency that brings with it the ability to process large amounts of information in relatively small amounts of time. 
    Think of generating more Gamma activity as getting a processor upgrade for your brain.

    Unfortunately Gamma brainwaves have received the least attention and research, although more attention is currently being paid to them.
    Having high amounts of Gamma Brainwave activity has been associated with:
    - Having high levels of intelligence
    - Being compassionate
    - Having high amounts of self-control
    - Having greater than average feelings of natural happiness.
    - Increased awareness through your five senses
    - Research has indicated at moments when bursts of precognition or high-level information processing occur, 
    your brainwaves briefly reach the Gamma state.

** IRC
   #emacs ##algorithms ##puzzles #gcj #hackerrank  
   if using weechat `/set irc.server.freenode.autojoin "##algorithms #emacs #gcj"`
   but usually use emacs's irc erc

** The Role of a Teacher (supervised learning)
   The purpose of a teacher is to raise the *right* questions for the student. 
   The role of a student is to seek answers.
   A question needs to be answered.
   Any question creates an empty space in the mind of the student that needs to be filled by answers.
