public/about.html

<div id="outline-container-org2b12f1c" class="outline-4">
<h4 id="org2b12f1c"><span class="section-number-4">1.9.4</span> Delta brainwaves</h4>
<div class="outline-text-4" id="text-1-9-4">
<p>
(0.1 to 3.5 Hz deep sleep )
This is the slowest band of waves that our brains produce and they occur when we are in deep, dreamless sleep. 
These waves are very beneficial for the body which restores and heals itself when in this state. 
The delta state releases anti-aging hormones, including melatonin and DHEA. 
Human growth hormone (HGH) is another anti-aging hormone that is increased when delta brainwaves are occurring inside the brain, 
due to the stimulation of the pituitary gland. HGH maintains the skin, bone density, cartilage, and the joints in your body as 
well as speeds up the healing process of joint and cartilage injuries. HGH can also help heal physical pain.
</p>

<p>
In healthy amounts, delta brainwaves can also cause a person to have an advanced state of empathy, understanding, and compassion for others.
Delta is the place of deepest relaxation, deepest healing, deepest spiritual connection and deepest connection with the subconscious mind. 
It is considered to be the gateway to the unconscious mind and the collective unconscious, bringing access to the universal psyche or mind.
</p>
</div>
</div>

<div id="outline-container-org19dae25" class="outline-4">
<h4 id="org19dae25"><span class="section-number-4">1.9.5</span> Gamma brainwaves</h4>
<div class="outline-text-4" id="text-1-9-5">
<p>
(40Hz or higher: zen mind mastery)
Gamma brainwave states are the most rapid in frequency. 
Gamma hase long been considered the the brainwave that is able to link and process information from all parts of the brain. 
It is the frequency that brings with it the ability to process large amounts of information in relatively small amounts of time. 
Think of generating more Gamma activity as getting a processor upgrade for your brain.
</p>

<p>
Unfortunately Gamma brainwaves have received the least attention and research, although more attention is currently being paid to them.
Having high amounts of Gamma Brainwave activity has been associated with:
</p>
<ul class="org-ul">
<li>Having high levels of intelligence</li>
<li>Being compassionate</li>
<li>Having high amounts of self-control</li>
<li>Having greater than average feelings of natural happiness.</li>
<li>Increased awareness through your five senses</li>
<li>Research has indicated at moments when bursts of precognition or high-level information processing occur,</li>
</ul>
<p>
your brainwaves briefly reach the Gamma state.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd6e6e9b" class="outline-3">
<h3 id="orgd6e6e9b"><span class="section-number-3">1.10</span> IRC</h3>
<div class="outline-text-3" id="text-1-10">
<p>
#emacs ##algorithms ##puzzles #gcj #hackerrank  
if using weechat `/set irc.server.freenode.autojoin "##algorithms #emacs #gcj"`
but usually use emacs's irc erc
</p>
</div>
</div>

<div id="outline-container-orgaa4e976" class="outline-3">
<h3 id="orgaa4e976"><span class="section-number-3">1.11</span> The Role of a Teacher (supervised learning)</h3>
<div class="outline-text-3" id="text-1-11">
<p>
The purpose of a teacher is to raise the <b>right</b> questions for the student. 
The role of a student is to seek answers.
A question needs to be answered.
Any question creates an empty space in the mind of the student that needs to be filled by answers.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zotherstupidguy</p>
<p class="date">Created: 2017-03-05 Sun 19:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
